[
    {
        "id":1,
        "jobTitle": "Frontend Developer",
        "jobDescription": "We are seeking a skilled Frontend Developer to create visually appealing and user-friendly web interfaces. The Frontend Developer will be responsible for coding, testing, and debugging frontend applications, as well as collaborating with UX/UI designers to ensure seamless integration of design and functionality. The ideal candidate should have strong proficiency in HTML, CSS, and JavaScript, experience with frontend frameworks such as React or Angular, and a solid understanding of responsive design principles.",
        "jobType": "Onsite",
        "educationalQualifications": [
            "Bachelor's or Master's degree in Computer Science or related field",
            "Proven experience in frontend web development"
        ],
        "experiences": 2,
        "jobResponsibilities": "Develop visually appealing and user-friendly web interfaces using HTML, CSS, and JavaScript. Collaborate with UX/UI designers to ensure seamless integration of design and functionality. Test and debug frontend applications to ensure optimal performance. Collaborate with cross-functional teams to gather requirements and define project scope. Stay up-to-date with emerging technologies and best practices in frontend development.",
        "location": "Seattle, WA",
        "salaryRange": "80k - 100k",
        "companyName": "Target",
        "companyLogo": "https://seeklogo.com/images/T/Target-logo-9FE48EBE3B-seeklogo.com.png",
        "phone": "555-123-4567",
        "email": "careers@target.com",
        "address": "9876 Innovation Avenue, Suite 432, Seattle, WA 98765"
    },
    {
        "id":2,
        "jobTitle": "Cloud Solutions Architect",
        "jobDescription": "We are looking for an experienced Cloud Solutions Architect to design, implement, and manage cloud-based infrastructure solutions. The Cloud Solutions Architect will be responsible for providing technical expertise in cloud computing technologies, developing cloud architecture designs, and collaborating with cross-functional teams to ensure successful implementation of cloud solutions. The ideal candidate should have strong knowledge of cloud computing platforms such as AWS, Azure, or Google Cloud, experience with infrastructure as code tools such as Terraform or CloudFormation, and a solid understanding of networking and security concepts in cloud environments.",
        "jobType": "Remote",
        "educationalQualifications": [
            "Bachelor's or Master's degree in Computer Science or related field",
            "Proven experience in cloud solutions architecture"
        ],
        "experiences": 5,
        "jobResponsibilities": "Design, implement, and manage cloud-based infrastructure solutions using cloud computing platforms such as AWS, Azure, or Google Cloud. Develop cloud architecture designs and provide technical expertise in cloud computing technologies. Collaborate with cross-functional teams to ensure successful implementation of cloud solutions. Define and implement infrastructure as code using tools such as Terraform or CloudFormation. Stay up-to-date with the latest developments in cloud computing, networking, and security.",
        "location": "Remote",
        "salaryRange": "120k - 150k",
        "companyName": "Google LLC",
        "companyLogo": "https://www.botconf.eu/wp-content/uploads/2015/02/google-logo.png",
        "phone": "111-987-6543",
        "email": "jobs@google-cloud-solutions.com",
        "address": "1234 Cloud Avenue, Suite 567, Remote, USA"
    },
    {
        "id":3,
        "jobTitle": "Backend Developer",
        "jobDescription": "We are seeking a skilled Backend Developer to design and implement server-side applications and databases. The Backend Developer will be responsible for developing APIs, writing server-side code, integrating with third-party APIs, and ensuring optimal performance and security. The ideal candidate should have strong proficiency in server-side programming languages such as Node.js, Python, or Ruby, experience with databases such as MongoDB or MySQL, and a solid understanding of RESTful APIs and microservices architecture.",
        "jobType": "Onsite",
        "educationalQualifications": [
            "Bachelor's or Master's degree in Computer Science or related field",
            "Proven experience in backend development"
        ],
        "experiences": 3,
        "jobResponsibilities": "Design and implement server-side applications and databases using server-side programming languages such as Node.js, Python, or Ruby. Develop APIs and write server-side code to ensure seamless integration with frontend applications. Integrate with third-party APIs and services. Optimize server-side code for performance and security. Collaborate with cross-functional teams to gather requirements and define project scope.",
        "location": "San Francisco, CA",
        "salaryRange": "90k - 110k",
        "companyName": "Netflix.",
        "companyLogo": "https://about.netflix.com/images/logo.png",
        "phone": "444-789-1234",
        "email": "careers@tech-solutions.com",
        "address": "5678 Tech Street, Suite 901, San Francisco, CA 12345"
    },
    {
        "id":4,
        "jobTitle": "Data Scientist",
        "jobDescription": "We are looking for an experienced Data Scientist to analyze and interpret complex data sets to derive insights and make data-driven decisions. The Data Scientist will be responsible for developing machine learning models, performing statistical analysis, and collaborating with cross-functional teams to identify patterns and trends. The ideal candidate should have strong expertise in programming languages such as Python or R, experience with machine learning frameworks such as TensorFlow or PyTorch, and a solid understanding of statistical concepts and data visualization techniques.",
        "jobType": "Remote",
        "educationalQualifications": [
            "Master's or PhD in Computer Science, Statistics, or related field",
            "Proven experience in data science or machine learning"
        ],
        "experiences": 5,
        "jobResponsibilities": "Analyze and interpret complex data sets to derive insights and make data-driven decisions. Develop machine learning models to solve business problems. Perform statistical analysis and create visualizations to communicate findings. Collaborate with cross-functional teams to identify patterns and trends in data. Stay up-to-date with the latest developments in data science and machine learning.",
        "location": "Remote",
        "salaryRange": "100k - 120k",
        "companyName": "Amazon",
        "companyLogo": "https://logos-world.net/wp-content/uploads/2020/04/Amazon-Logo.png",
        "phone": "222-456-7890",
        "email": "jobs@data-insights.com",
        "address": "7890 Data Avenue, Suite 234, Remote, USA"
    },
    {
        "id":5,
        "jobTitle": "Software Engineer",
        "jobDescription": "We are seeking a highly skilled and motivated Software Engineer to develop and maintain high-quality software solutions. The Software Engineer will be responsible for coding, testing, debugging, and documenting software applications, as well as collaborating with cross-functional teams to ensure successful project delivery. The ideal candidate should have strong programming skills, experience with software development methodologies, and a solid understanding of software engineering principles.",
        "jobType": "Onsite",
        "educationalQualifications": [
            "Bachelor's or Master's degree in Computer Science or related field",
            "Proven experience in software development"
        ],
        "experiences": 3,
        "jobResponsibilities": "Develop and maintain software applications using programming languages and tools. Collaborate with cross-functional teams to gather requirements and define project scope. Test and debug software applications to ensure quality and performance. Document software design, coding, and testing activities. Stay up-to-date with emerging technologies and best practices in software engineering.",
        "location": "San Francisco, CA",
        "salaryRange": "100k - 120k",
        "companyName": "Microsoft",
        "companyLogo": "https://logos-world.net/wp-content/uploads/2020/09/Microsoft-Logo.png",
        "phone": "555-987-6543",
        "email": "careers@microsoft.com",
        "address": "1234 Tech Avenue, Suite 567, San Francisco, CA 12345"
    },
    {
        "id":6,
        "jobTitle": "Database Engineer",
        "jobDescription": "We are seeking a skilled Database Engineer to design, develop, and maintain database systems that support the organization's applications and data requirements. The Database Engineer will be responsible for optimizing database performance, ensuring data security and integrity, and troubleshooting and resolving database-related issues. The ideal candidate should have strong expertise in database management systems such as MySQL, Oracle, or MongoDB, as well as experience with data modeling, database design, and performance tuning.",
        "jobType": "Onsite",
        "educationalQualifications": [
            "Bachelor's or Master's degree in Computer Science or a related field",
            "Proven experience in database engineering or a related field"
        ],
        "experiences": 3,
        "jobResponsibilities": "1. Design, develop, and maintain database systems to support applications and data requirements.\n2. Optimize database performance by tuning database parameters, indexing, and query optimization.\n3. Ensure data security and integrity by implementing proper access controls, backups, and disaster recovery plans.\n4. Troubleshoot and resolve database-related issues, including performance, data integrity, and data migration.\n5. Collaborate with cross-functional teams, including developers, system administrators, and data scientists, to ensure smooth integration of database systems with other applications.\n6. Stay up-to-date with the latest trends and technologies in database engineering and recommend best practices for database design and performance optimization.\n7. Provide technical guidance and support to junior database engineers, as needed.",
        "location": "San Francisco, CA",
        "salaryRange": "90k - 120k",
        "companyName": "Flipkart",
        "companyLogo": "https://logos-world.net/wp-content/uploads/2020/11/Flipkart-Logo.png",
        "phone": "+1 (555) 123-4567",
        "email": "jobs@flipkart.com",
        "address": "1234 Tech Street, Suite 567, San Francisco, CA 12345"
    }
]